In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,8,7,6]])

In [6]:
df1

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  9  8  7  6

In [7]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [8]:
df1.tail(1)

   0  1  2  3
2  9  8  7  6

In [9]:
df1.shape

(3, 4)

In [10]:
df2=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,8,7,6],[4,5,6,7]])

In [11]:
df2

   0  1  2  3
0  1  2  3  4
1  5  6  7  8
2  9  8  7  6
3  4  5  6  7

In [17]:
df2.iloc[2:4,2:4]

   2  3
2  7  6
3  6  7